I ran a `terraform plan` locally against the built binary from the changes in this PR, looks ok so far.
Also the aws credentials were obtained from `aws configure sso`

```bash
Terraform will perform the following actions:

  # controltower_aws_account.account will be created
  + resource "controltower_aws_account" "account" {
      + account_id                       = (known after apply)
      + close_account_on_delete          = false
      + email                            = "aws-admin@example.com"
      + id                               = (known after apply)
      + name                             = "Example Account"
      + organizational_unit              = "Sandbox"
      + organizational_unit_id_on_delete = "ou-redacted"
      + path_id                          = (known after apply)
      + provisioned_product_name         = (known after apply)

      + sso {
          + email      = "john.doe@example.com"
          + first_name = "John"
          + last_name  = "Doe"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```